app/views/courses/show.html.erb

  <tbody>
  <% @course.students.each do |student| %>
---
SELECT "students".* FROM "students" INNER JOIN "classrooms" ON "students"."id" = "classrooms"."student_id" WHERE "classrooms"."course_id" = ?  [["course_id", 1]]