app/controllers/courses_controller.rb

SELECT "courses".* FROM "courses"
SELECT "statuses".* FROM "statuses" WHERE "statuses"."id" IN (1)
---
  def index
    @courses = Course.all.includes(:course_status)

INSERT INTO "courses" ("name", "description", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "dasdasdasdasd"], ["description", "dsadasdasdasdasdasdasdasdasddsadas"], ["status", 1], ["created_at", "2016-02-06 19:33:04.971615"], ["updated_at", "2016-02-06 19:33:04.971615"]]
---
  def create
    if @course = Course.create(course_params)

SELECT "students".* FROM "students" INNER JOIN "classrooms" ON "students"."id" = "classrooms"."student_id" WHERE "classrooms"."course_id" = ?  [["course_id", 1]]
---
  def set_students
    @classroom = Classroom.new course_id: @course.id
    @students = Student.includes(:classrooms).where(classrooms: {id: nil}).pluck :name, :id